{"url": "/about", "title": "Personal Summary", "text": "I’m Yonas Atinafu, an AI and machine learning researcher and engineer focused on trustworthy and practical AI systems. I’m currently an MMath Computer Science student at the University of Waterloo (AI group), supervised by Professor Robin Cohen and co-supervised by Professor Jamal Bentahar. My work sits at the intersection of responsible AI, agentic systems, and applied machine learning, with strong engineering depth across ML systems, evaluation, and deployment. I care about building AI that is reliable under real constraints: limited compute, noisy labels, shifting distributions, and the need for transparent user control. Core strengths Machine learning research and experimentation: rigorous evaluation, ablations, failure analysis. ML engineering: end-to-end pipelines, reproducible experiments, deployment-oriented thinking. ML systems mindset: latency/throughput tradeoffs, inference constraints, pragmatic optimization. Communication: turning research into clear artifacts (papers, slides, demos) and production-ready code. Selected projects and research PixLift (ACM COMPASS 2025 submission): A Chromium-based approach to reducing web data usage by requesting smaller images and upscaling on-device using efficient super-resolution, trading bandwidth for compute. EEG-based neurohaptics / haptic decoding: Graph-based and deep learning approaches to decoding perceptual experience from EEG, with strong emphasis on evaluation reliability (e.g., label quality, LOSO generalization). Agentic and trustworthy AI directions: Interest in evaluation integrity, reliable tool use, and systems that remain dependable in messy real-world settings. Background I completed my undergraduate studies at NYU Abu Dhabi. I’ve worked as a research assistant across multiple labs, building and evaluating ML models and systems, and translating research prototypes into usable tools. What I’m looking for Roles and collaborations where I can combine research-level thinking with engineering execution: ML engineer, applied scientist, AI engineer, ML systems, or trustworthy/agentic AI work. If you want to collaborate, the best way is to reach out by email with a short note on what you’re building and what you need."}
{"url": "/404", "title": "404: This page could not be found", "text": "404 This page could not be found ."}
{"url": "/about", "title": "Yonas Atinafu | About", "text": "About Me 📖 Master of Mathematics (MMath), Computer Science at University of Waterloo [Sep 2025 – Aug 2027] 📖 B.Sc. in Computer Science (Minor in Applied Mathematics) from New York University Abu Dhabi [Aug 2021 – May 2025]. 🤖 Interests: Software Development, Deep Learning, LLMs, Applied AI, Research. 💻 Current Role: Graduate Research Assistant & Graduate Teaching Assistant at the University of Waterloo. 💻 Completed Capstone Project at ComNets Lab, NYUAD : Enhancing Mobile Web Browsing through Real-time Image Super-Resolution. Relevant Experience Undergraduate Research Assistant at AIM lab, NYUAD , developed and implemented Graph Neural Networks for EEG-based neurohaptic research (link prediction & graph classification) with LOSO evaluation; standardized entropy features and PLV/correlation edges to reduce run-to-run variance and training overhead. [May 2024 – Jul 2025, Abu Dhabi, UAE] Tech Intern at a start-up (Project KUWA) : worked as a full-stack web developer using the MERN stack; introduced smoke tests that reduced regression bugs by ~30%. [May 2023 – Sep 2023, Remote (Michigan)] AI Peer Mentor at Design Lab: AI, NYUAD : Mentored a team on ideation, data prep, and evaluation — the team won the Sustainable Project Award against 7 other teams. [May 2024 – Jun 2024, Abu Dhabi, UAE] Additional Experience NYUAD Art Gallery Assistant - Production and Docent : Managed the front desk, guided tours, and assisted the exhibition design technician with special projects. [Sep 2022 – Jun 2023, Abu Dhabi, UAE] Varsity Athletic Events Staff at NYU Athletics : Guided visiting teams, coaches, opponents, and officials (Primary host responsibility for teams and VIPs). [Sep 2023 – Jan 2024, New York City, United States]"}
{"url": "/contact", "title": "Yonas Atinafu | Contact", "text": "Find Me On tag: production Yonas : — contact : Email : yatinafu@uwaterloo.ca Phone : null GitHub : github.com/Yonas650 LinkedIn : linkedin.com/in/yonas-atinafu-b35921372 Portfolio Website : Website"}
{"url": "/github", "title": "Yonas Atinafu | GitHub", "text": "Yonas650 36 repos 2 followers My Most Popular Repositories on Github Real-Time-Object-Detection Real-time object detection system utilizing the SSD MobileNet V2 FPNLite 320x320 model for high-speed, efficient recognition. 5 0 5 ML-Driven-CLV-Prediction This project predicts Customer Lifetime Value (CLV) for e-commerce. It aims at forecasting the revenue a business can expect from a customer over time. I did an explatory analysis. From Linear Regression to Neural Networks, explore how different models perform in predicting CLV. 3 1 3 Image-classification-VGG16 This project modifies the classic VGG16 architecture to classify images into four distinct categories with high accuracy. It incorporates data augmentation, dynamic learning rate adjustments, and comprehensive performance evaluation using accuracy metrics and confusion matrices. Built with PyTorch and supported by a suite of powerful libraries 2 0 2 Spotify_Stock_Analysis This is an in-depth exploratory data analysis of Spotify's stock performance from January 1, 2018, to the present. Utilizing Python and a robust set of libraries, this project examines trends, volatility, and external influences on Spotify's stocks using data from Yahoo Finance. From trend analysis and volatility exploration to predictive modeling. 2 0 2 Cancer-Classification-Gene-Expression-using-svm-randomforest-and-cnn 1 0 1 Anonymous_Course_Review_Site 0 0 0 Astro_Mania 0 0 0 Bit_Manipulation 0 0 0 My Github Calendar"}
{"url": "/", "title": "Yonas Atinafu | Home", "text": "AI ML Software Yonas Atinafu Software Developer | Machine Learning Engineer Skill Set Python Research Generative AI JavaScript React Node.js TensorFlow PyTorch Machine-Learning Computer-Vision Data-Science SQL Software-Engineering MongoDB APIs About Me Contact"}
{"url": "/papers", "title": "Yonas Atinafu | Papers", "text": "My Publications PixLift: Accelerating Web Browsing via AI Upscaling Abstract: Accessing the internet in regions with expensive data plans and limited connectivity poses significant challenges, restricting information access and economic growth. Images, as a major contributor to webpage sizes, exacerbate this issue, despite advances in compression formats like WebP and AVIF. The continued growth of complex and curated web content, coupled with suboptimal optimization practices in many regions, has prevented meaningful reductions in web page sizes. This paper introduces PixLift, a novel solution to reduce webpage sizes by downscaling their images during transmission and leveraging AI models on user devices to upscale them. By trading computational resources for bandwidth, PixLift enables more affordable and inclusive web access. We address key challenges, including the feasibility of scaled image requests on popular websites, the implementation of PixLift as a browser extension, and its impact on user experience. Through the analysis of 71.4k webpages, evaluations of three mainstream upscaling models, and a user study, we demonstrate PixLift’s ability to significantly reduce data usage without compromising image quality, fostering a more equitable internet. Conference: COMPASS '25: Proceedings of the ACM SIGCAS/SIGCHI Conference on Computing and Sustainable Societies Year: 2025 Citations: 0 Read Paper"}
{"url": "/projects", "title": "Yonas Atinafu | Projects", "text": "Open Source Projects Machine Learning LoRA_SFT Fine-tuned the 135M-parameter SmolLM model using LoRA (Low-Rank Adaptation) for creative text generation. Conducted ablations on LoRA rank and base model (SmolLM vs GPT-2) using TRL and PEFT frameworks. Achieved a perplexity drop from 1.455 to 1.238 with only ~18 minutes of training on a T4 GPU. Includes visualizations of training curves, ablation comparisons, and generated samples. Python LoRA Fine-Tuning Transformer Hugging Face Machine Learning Natural Language Processing Code Production RAG Pipeline A production-ready, fully local RAG system: ingests PDFs into a FAISS inner-product index, serves retrieval via FastAPI, and generates cited answers with Flan-T5. Includes a minimal web UI, JSON endpoints (/search, /query), adjustable top_k/score_threshold, and pluggable device selection (CPU/MPS/CUDA). Python RAG FAISS FastAPI Flan-T5 NLP Information Retrieval Code ML Models for Mutation Impact Analysis This project involves building machine learning models like CNN, GRU, Random Forest, and SVM to analyze the impact of mutations in genetic data. The models are trained using a combination of SMOTE and RandomUnderSampler for handling imbalanced data and feature engineering techniques tailored for mutation data. Python Bioinformatics Machine-Learning Deep-Learning CNN GRU Random-Forest SVM Code Cancer Classification Using Gene Expression Data A project focused on classifying different types of cancer using gene expression data. The classification models used include SVM, Random Forest, and CNN, with feature engineering and data preprocessing steps tailored for gene expression datasets. Python Machine-Learning Deep-Learning SVM Random-Forest CNN Bioinformatics Gene-Expression Cancer-Classification Code Real-Time Object Detection I developed a program that can detect 80 different objects in realtime using SSD MobileNet V2 FPNLite model. Python OpenCV AI Computer-Vision Deep-Learning Tensorflow Numpy Code Image Classification using Deep Learning Developed a deep learning-based clothes classification model using PyTorch and VGG16, with image preprocessing, model training and validation, and accuracy assessment. Python Machine Learning Deep-Learning Numpy Scikit-Learn PIL PyTorch Code Graph Neural Networks for EEG This repository explores the use of Graph Neural Networks (GNNs) for analyzing EEG data. By treating EEG channels as nodes in a graph, GNNs can capture the complex relationships between different brain regions, offering a powerful approach for EEG-based tasks. Python EEG Graph-Neural-Networks GNN Neuroscience Code LSTM-CNN for EEG A project leveraging a hybrid LSTM-CNN model to analyze and classify EEG signals. The model is designed to capture both temporal and spatial features from the EEG data. Python EEG Deep-Learning LSTM CNN Neuroscience Code CNN-Transformer for EEG This project combines CNNs and Transformers to process and classify EEG data. The CNN extracts spatial features while the Transformer model handles sequential dependencies, providing a robust solution for EEG signal analysis. Python EEG Deep-Learning CNN Transformer Neuroscience Code Machine Learning-Driven-CLV-Prediction I did exploratory data analysis using python and built a predictive model that can accurately forecast the Customer Lifetime Value (CLV) for an e-commerce business. Python Customer-Retention Machine-Learning Random-Forest Linear-Regression Neural-Networks Data Analysis Code Spotify Stock Analysis I analyzed Spotify's current stock trends using Python tools. I also made predictions using Linear Regression. Python Finance Exploratory Data Analysis Technology Pandas Seaborn Web-Scraping Code OpenAI API Projects Terms and Conditions Summarizer This web application provides a concise, understandable summary of key points in Terms of Service documents, helping users understand their rights and obligations before agreeing to them. Utilizes advanced AI techniques to parse and summarize complex legal documents. Node.js Express GPT OpenAI AI Summarization Handlebars Bootstrap Code Demo Smart Nutrition Assistant Smart Nutrition Assistant is a web application designed to help users track and analyze their dietary habits with the help of AI. This tool uses the GPT-4 Vision API for food picture recognition and dietary advice, offering a user-friendly interface for meal tracking and nutritional insights.. Health AI Nutrition Private Project Code Travel Planner Travel Planner is an AI-powered application that helps users plan their trips efficiently. Utilizing the GPT-4 API, this tool offers personalized travel itineraries, suggestions, and insights based on user preferences and constraints. Python AI Travel GPT-4 Web-Application Travel-Planner Code Misc Projects Decaf Bytecode VM Decaf is a compact language compiler and virtual machine built entirely in Python. It includes a hand-written lexer, Pratt parser, semantic resolver, and a bytecode compiler targeting a lightweight stack-based VM. The toolchain supports lexical scoping, immutability rules, function calls, disassembly tooling, and a CLI for compiling, executing, and tracing bytecode programs. Python Compiler Virtual Machine Bytecode Language Design Systems Programming Code Pern Budget Tracker Budget Tracker is a comprehensive web application designed to help users manage their finances efficiently by tracking their expenses and incomes. Built using the PERN stack, this app provides detailed financial insights and easy-to-use budget management tools. JavaScript React Node.js Express PostgreSQL Full-Stack Finance Budget-Tracking Code Astro Mania A challenging arcade game developed in Python, where players navigate a spaceship through various levels. Game Development Python Code Tetris Rush A fast-paced version of the classic Tetris game, built with Python to offer an engaging puzzle-solving experience. Game Python Tetris Code Bit Manipulation Educational project that demonstrates various bit manipulation techniques using C programming. C Education Programming Code Blackjack A web-based version of the Blackjack card game, designed to provide a fun and interactive gaming experience. JavaScript Game Blackjack Code Crazy 8 Game Digital version of the popular Crazy 8 card game, developed to offer both single and multiplayer modes. JavaScript Game Crazy 8 Code Connect 4 A Python implementation of the classic board game Connect 4. This project allows two players to compete directly, demonstrating Python's utility in developing interactive applications. Python Game Development Code Flight-Ticket Management System A system for managing flight tickets using C++. It efficiently handles bookings and schedules, showcasing advanced C++ programming and data structure utilization. C++ Data Structures Management System Code Contact Management System A C++ based application designed to manage personal and professional contacts. It incorporates basic file handling and data management principles to organize contact information efficiently. C++ File Handling Contact Management Code Task Manager A JavaScript-based web application for managing tasks. It allows users to add, delete, and organize tasks with an interactive and user-friendly interface. JavaScript Web App Task Management Code Mern Budget Tracker Web App This web app helps users track their expenses and manage their budget. Built using JavaScript, it provides insights into spending patterns with graphical data visualization. JavaScript Finance Web App Code Anonymous Course Review Site A platform for students to anonymously submit and review feedback on courses and instructors. It fosters a culture of transparency and helps improve educational standards. JavaScript Education Web Development Code"}
{"url": "/resume", "title": "Yonas Atinafu | Resume", "text": "Having trouble viewing? Open in new tab Resume"}
{"url": "/settings", "title": "Yonas Atinafu | Settings", "text": "Manage Themes Dracula Dracula Theme Set Color Theme GitHub Dark GitHub Set Color Theme Ayu Dark teabyii Set Color Theme Ayu Mirage teabyii Set Color Theme Nord arcticicestudio Set Color Theme Night Owl sarah.drasner Set Color Theme"}
